# HeadersFootersBlanks Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewScheduleExportOptions..::..HeadersFootersBlanks Property
ViewScheduleExportOptions Class See Also
---
Whether to export group headers, footers, and blank lines. Default is true.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HeadersFootersBlanks { get; set; }
```

Visual Basic
---
```text
Public Property HeadersFootersBlanks As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HeadersFootersBlanks {
	bool get ();
	void set (bool value);
}
```

# See Also
ViewScheduleExportOptions Class
Autodesk.Revit.DB Namespace